Failed to extend or trim some layer at an end join
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CouldNotAdjustWallPartsAtJoin { get; }
  Visual Basic
Public Shared ReadOnly Property CouldNotAdjustWallPartsAtJoin As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CouldNotAdjustWallPartsAtJoin {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PartMakerMethodForWallFailures Class
  Autodesk.Revit.DB Namespace